mxq1688/esp/projects/esp32-s3/sdkconfig.defaults
# ESP32-S3 specific configuration
CONFIG_IDF_TARGET="esp32s3"

# Enable ESP32-S3 USB Serial/JTAG Controller
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# Bootloader config
CONFIG_BOOTLOADER_LOG_LEVEL_INFO=y

# Serial flasher config
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# Partition Table
CONFIG_PARTITION_TABLE_SINGLE_APP=y

# Compiler options
CONFIG_COMPILER_OPTIMIZATION_SIZE=y

# Log output
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_INFO=y 